In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.set_option('display.width',1000)
pd.set_option('display.max_colwidth',10)
titanic_df = pd.read_csv(r'C:\Users\kis91\Desktop\python study\data\titanic\titanic_train.csv')
titanic_df.head(3)

   PassengerId  Survived  Pclass       Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked
0          1           0       3  Braund...    male  22.0      1      0  A/5 21171   7.2500   NaN        S
1          2           1       1  Cuming...  female  38.0      1      0   PC 17599  71.2833   C85        C
2          3           1       3  Heikki...  female  26.0      0      0  STON/O...   7.9250   NaN        S

In [3]:
#칼럼추가

titanic_df['Age_0'] = 0
print('칼럼 추가\n',titanic_df.head(3))


titanic_df['Age_by_10'] = titanic_df['Age']*10
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch']+1
print('칼럼 추가\n',titanic_df.head(3))

칼럼 추가
    PassengerId  Survived  Pclass       Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked  Age_0
0          1           0       3  Braund...    male  22.0      1      0  A/5 21171   7.2500   NaN        S      0
1          2           1       1  Cuming...  female  38.0      1      0   PC 17599  71.2833   C85        C      0
2          3           1       3  Heikki...  female  26.0      0      0  STON/O...   7.9250   NaN        S      0
칼럼 추가
    PassengerId  Survived  Pclass       Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked  Age_0  Age_by_10  Family_No
0          1           0       3  Braund...    male  22.0      1      0  A/5 21171   7.2500   NaN        S      0      220.0          2
1          2           1       1  Cuming...  female  38.0      1      0   PC 17599  71.2833   C85        C      0      380.0          2
2          3           1       3  Heikki...  female  26.0      0      0  STON/O...   7.9250   NaN        S      0      260.0          1

In [4]:
# 칼럼삭제

titanic_drop_df = titanic_df.drop('Age_0',axis=1,inplace=False)
print('inplace가 False이면 원래 데이터는 그대로\n',titanic_drop_df.head(3),'\n원래 데이터')
print(titanic_df.head(3))

drop_result = titanic_df.drop(['Age_0','Age_by_10','Family_No'],axis=1,inplace=True)
print('inplace가 True이면 원래 데이터에서 제거\n',drop_result,'\원래 데이터')
print(titanic_df.head(3))

inplace가 False이면 원래 데이터는 그대로
    PassengerId  Survived  Pclass       Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked  Age_by_10  Family_No
0          1           0       3  Braund...    male  22.0      1      0  A/5 21171   7.2500   NaN        S      220.0          2
1          2           1       1  Cuming...  female  38.0      1      0   PC 17599  71.2833   C85        C      380.0          2
2          3           1       3  Heikki...  female  26.0      0      0  STON/O...   7.9250   NaN        S      260.0          1
원래 데이터
   PassengerId  Survived  Pclass       Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked  Age_0  Age_by_10  Family_No
0          1           0       3  Braund...    male  22.0      1      0  A/5 21171   7.2500   NaN        S      0      220.0          2
1          2           1       1  Cuming...  female  38.0      1      0   PC 17599  71.2833   C85        C      0      380.0          2
2          3           1       3  Heikki...  female  26.0      0      0  STON/O...   7.9250   NaN        S      0      260.0          1
inplace가 True이면 원래 데이터에서 제거
 None \원래 데이터
   PassengerId  Survived  Pclass       Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked
0          1           0       3  Braund...    male  22.0      1      0  A/5 21171   7.2500   NaN        S
1          2           1       1  Cuming...  female  38.0      1      0   PC 17599  71.2833   C85        C
2          3           1       3  Heikki...  female  26.0      0      0  STON/O...   7.9250   NaN        S

In [5]:
#행 삭제

print('원래 데이터\n',titanic_df.head(3))
titanic_df.drop([0,1,2],axis=0,inplace=True)
print('행 삭제된 데이터\n',titanic_df.head(3))

원래 데이터
    PassengerId  Survived  Pclass       Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked
0          1           0       3  Braund...    male  22.0      1      0  A/5 21171   7.2500   NaN        S
1          2           1       1  Cuming...  female  38.0      1      0   PC 17599  71.2833   C85        C
2          3           1       3  Heikki...  female  26.0      0      0  STON/O...   7.9250   NaN        S
행 삭제된 데이터
    PassengerId  Survived  Pclass       Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3          4           1       1  Futrel...  female  35.0      1      0  113803  53.1000  C123        S
4          5           0       3  Allen,...    male  35.0      0      0  373450   8.0500   NaN        S
5          6           0       3  Moran,...    male   NaN      0      0  330877   8.4583   NaN        Q